app/controllers/api/channels_controller.rb

SELECT "channels".* FROM "channels"
---
  def index
    render json: Channel.all()

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Channel.find(params[:id])