app/controllers/api/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    render json: Message.all()