app/controllers/api/workspaces_controller.rb

SELECT "workspaces".* FROM "workspaces"
---
  def index
    render json: Workspace.all()