app/channels/chat_channel.rb

  def create(opts)
    Message.create(
      body: opts.fetch('body'),
      user_id: opts.fetch('user_id'),
      chatroom_id: opts.fetch('chatroom_id')
    )
---
INSERT INTO "messages" ("body", "created_at", "updated_at", "user_id", "chatroom_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "test"], ["created_at", "2018-10-16 21:10:29.637424"], ["updated_at", "2018-10-16 21:10:29.637424"], ["user_id", 1], ["chatroom_id", 1]]