app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "k9Hn15JqBKiuXDxq7Prrsw"], ["updated_at", "2018-10-14 20:11:49.301898"], ["id", 1]]